snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Профит/Профит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Профит</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклаутры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>КолРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Профит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродажиБезВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧерезКассу</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ЛогиОстатковТМЦ/ЛогиОстатковТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогиОстатковТМЦ</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения1</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>допинф</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DelДатаИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/RecordSetModule.bsl
Процедура СформироватьДвиженияПоПрофиту() Экспорт	
	Регистратор			=Отбор.Регистратор.Значение;
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат КонецЕсли;
	
	СписокРеквизитов=Новый Структура("Дата");
	//крохин начало 10.04.2012
	//РНК-подарки формируют затраты, а не профит
	Если Регистратор.Метаданные().Имя = "РасходнаяНакладная" Тогда
		СписокРеквизитов.Вставить("Подарок");
		РеквизитыРегисратора=ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);
		Если РеквизитыРегисратора.Подарок Тогда
			Возврат;
		КонецЕсли;
	Иначе
		РеквизитыРегисратора=ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);
	КонецЕсли;
	
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	////крохин конец 10.04.2012
	////крохин начало 08.12.2011
	////добавил рекламации (вычерки)
	////МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ");
	////крохин начало 19.02.2016
	////добавил корректировки цен в накладной
	////МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	//Если РеквизитыРегисратора.Дата >= '20160201' Тогда
	//	МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная,ДокументСсылка.КорректировкаЦенВНакладной ");
	//Иначе
	//	МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная");
	//КонецЕсли;	
	//
	////крохин конец 19.02.2016
	////крохин конец 08.12.2011
	МТ=Новый ОписаниеТипов("ДокументСсылка.РасходнаяНакладная,ДокументСсылка.ПриходнаяНакладная,ДокументСсылка.ОтчетКассовойСмены,ДокументСсылка.ПродажаИМ,ДокументСсылка.РекламационнаяНакладная,ДокументСсылка.КорректировкаЦенВНакладной,ДокументСсылка.ОтчетКомиссионера");
	//крохин конец 05.05.2020
	
	
	Если НЕ МТ.СодержитТип(ТипЗнч(Регистратор)) Тогда Возврат КонецЕсли; 
	
	
	Запрос=Новый Запрос;
	//крохин начало
	//ВозвратПоставщику формирует движения по затратам, а не профиту. С 01.07.2010
	Если РеквизитыРегисратора.Дата >= '20100701' Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		//	|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ
		|	Период,
		|	Номенклатура.Родитель.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Подразделение,
		|	КодОперации,
		|	Отправитель КАК Контрагент,
		|	СУММА(Оборот)-СУММА(ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Сумма) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ		
		|ГДЕ
		|	ОстаткиТМЦ.Регистратор = &Регистратор
		|	И КодОперации В (ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата))
		|СГРУППИРОВАТЬ ПО 
		|	Период,Номенклатура.Родитель.ВидНоменклатуры,Отправитель,Подразделение,КодОперации";
		
	КонецЕсли;
	//крохин конец
	
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Выборка=Запрос.Выполнить().Выбрать();
	
	НЗ=РегистрыНакопления.Профит.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	
	Пока Выборка.Следующий() Цикл
		Запись=НЗ.Добавить();
		
		Запись.ВидДвижения=ВидДвиженияНакопления.Приход;			
		ЗаполнитьЗначенияСвойств(Запись,Выборка);		
	КонецЦикла;		
	
	НЗ.Записать();	
КонецПроцедуры

Процедура СформироватьДвиженияПоПродажам() Экспорт
	Регистратор			=Отбор.Регистратор.Значение;
	Если НЕ ЗначениеЗаполнено(Регистратор) Тогда Возврат КонецЕсли;
	
	МТ = РегистрыНакопления.Продажи.СоздатьНаборЗаписей().Отбор.Регистратор.ТипЗначения;
	Если НЕ МТ.СодержитТип(ТипЗнч(Регистратор)) Тогда Возврат КонецЕсли;
	
	СписокРеквизитов	= Новый Структура("Организация,Дата");
	
	РеквизитыРегисратора= ПолучитьРеквизитыШапки(Регистратор,СписокРеквизитов);	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА Количество ИНАЧЕ 0 КОНЕЦ 	КАК КолРасх,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА Количество ИНАЧЕ 0 КОНЕЦ	КАК КолПрих,	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА Сумма ИНАЧЕ 0	КОНЕЦ	   	КАК СумРасх,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА Сумма	ИНАЧЕ 0	КОНЕЦ 		КАК СумПрих,
	|	ВЫБОР КОГДА ВидДвижения = &Приход ТОГДА -1 ИНАЧЕ 1 КОНЕЦ * Сумма 	КАК СумОборот,	
	|	Оборот КАК Оборот,
	|	ОборотБезСкидки КАК ОборотБезСкидки,
	|	ОборотБезСкидки - Оборот КАК Скидка,	
	|	Оборот - ВЫБОР	КОГДА ВидДвижения = &Расход	ТОГДА 1	ИНАЧЕ -1 КОНЕЦ*Сумма КАК Профит,	
	|	ВЫБОР КОГДА ВидДвижения = &Расход ТОГДА 1 ИНАЧЕ -1 КОНЕЦ*Количество КАК ПродажиБезВозврата,
	|	
	|	Период,
	|	Номенклатура,
	|	Подразделение,
	|	Отправитель 	КАК Покупатель,
	|	ПунктДоставки 	КАК ПунктДоставки,
	|	ВЫБОР КОГДА Регистратор ССЫЛКА Документ.ОтчетКассовойСмены ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ЧерезКассу,	
	|	ВЫБОР
	|		КОГДА Регистратор ССЫЛКА Документ.РасходнаяНакладная ТОГДА Регистратор.Менеджер
	|		КОГДА Регистратор ССЫЛКА Документ.ПриходнаяНакладная ТОГДА Регистратор.Менеджер
	|		КОГДА Регистратор ССЫЛКА Документ.РекламационнаяНакладная ТОГДА Регистратор.Менеджер 
	|		КОГДА Регистратор ССЫЛКА Документ.КорректировкаЦенВНакладной ТОГДА Регистратор.Менеджер
	|		КОГДА Отправитель ССЫЛКА Справочник.Контрагенты	ТОГДА Отправитель.Менеджер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК Менеджер,	
	|	КодОперации,	
	|	Регистратор.Организация КАК Организация	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ КАК Остатки
	|ГДЕ	
	|	Регистратор=&Регистратор
	|	И Активность
	|	И КодОперации В (
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Реализация),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратОтПокупателя),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),
	|		ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ПогашениеСертификата)
	|	)	
	|";
	
	Запрос.УстановитьПараметр("Регистратор",Регистратор);
	Запрос.УстановитьПараметр("Приход",		ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Расход",		ВидДвиженияНакопления.Расход);
	
	// Кухарь А.Ю.  16.02.2023 начало
	//Возврат поставщику у РНК не должен делать проводок по продажам
	если ТипЗнч(Регистратор)=Тип("ДокументСсылка.РасходнаяНакладная") и РеквизитыРегисратора.Дата>='20230101' тогда
		запрос.Текст=СтрЗаменить(запрос.Текст,"ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.ВозвратПоставщику),","");
	КонецЕсли;
	// Кухарь А.Ю.  16.02.2023 конец
	
	Выборка	= Запрос.Выполнить().Выбрать();
	
	НЗ=РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(Регистратор);
	
	Пока Выборка.Следующий() Цикл
		Запись	= НЗ.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,Выборка);		
	КонецЦикла;		
	
	НЗ.Записать();
КонецПроцедуры
 

Процедура ПриЗаписи(Отказ, Замещение)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СформироватьДвиженияПоПрофиту();
		СформироватьДвиженияПоПродажам();
	КонецЕсли;	
	
	//крохин начало 07.05.2024
    //в филиале нужна проводка по регистру "продажи"
    Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.ТорговоеПодразделение Тогда
	    СформироватьДвиженияПоПродажам();
    КонецЕсли;
	//крохин конец 07.05.2024
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)                                                                                                                                                             
	//+++Чирков 18.09.2025 - кто натыкал сюда дичи такой - как вообще склад до сих пор работает ?
	//Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи  И Отбор.Регистратор.Значение.Дата < ТекущаяДата() И ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	Если НЕ ПараметрыСеанса.ОтключитьЖурнализациюЗаписи
		И Маркировка_ПИ.ТипТекущегоУзла("Основной") = Перечисления.ТипУзлаИБ.УправляющееПодразделение		
		И ПолучитьРеквизитШапки(Отбор.Регистратор.Значение, "Дата") < ТекущаяДата() Тогда
	//---Чирков 18.09.2025
	
		Запрос=Новый запрос;
		запрос.Текст="ВЫБРАТЬ
					 |	ЛогиОстатковТМЦ.Документ,
					 |	ЛогиОстатковТМЦ.ДатаИзменения1
					 |ИЗ
					 |	РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
					 |ГДЕ
					 |	ЛогиОстатковТМЦ.Документ = &Документ
					 |	И КОНЕЦПЕРИОДА(ЛогиОстатковТМЦ.ДатаИзменения1, ДЕНЬ) = КОНЕЦПЕРИОДА(&ДатаИзменения, ДЕНЬ)";
		
		Запрос.УстановитьПараметр("Документ", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("ДатаИзменения",ТекущаяДата());
			
		Выб=Запрос.Выполнить().Выбрать();
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьНаборЗаписей();
		Если выб.Следующий() тогда //Надо перезаписать
			Запись.Отбор.Документ.Установить(выб.документ.ссылка);
			Запись.Отбор.ДатаИзменения1.Установить(выб.ДатаИзменения1);
			Запись.Прочитать();
			Запись.Очистить();
			Запись.Записать();
		Конецесли;
		
		Запись=РегистрыСведений.ЛогиОстатковТМЦ.СоздатьМенеджерЗаписи();
	  	
		Если ЭтотОбъект.Количество()=0 тогда
			Запись.ДопИнф="Нули";
		Конецесли;
		
		Запись.ДатаИзменения1 = ТекущаяДата();
		Запись.Документ     =Отбор.Регистратор.Значение;
		Запись.Записать();
		
	КонецЕсли;
	
	Если ОбщегоНазначения_ПИ.ЭтоУзел_Склад() Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если Запись.Сумма<>0 Тогда
				Запись.Сумма=0;			
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры
